biccius/LVGL-STM32H757-EVA/Test-lvgl-757/CM7/Drivers/BSP/STM32H747I-Discovery/stm32h757i_discovery.c
 #ifdef __GNUC__
 int __io_putchar (int ch)
 #else
 int fputc (int ch, FILE *f)
 #endif /* __GNUC__ */
{
  (void)HAL_UART_Transmit (&hcom_uart [COM_ActiveLogPort], (uint8_t *) &ch, 1, COM_POLL_TIMEOUT);
  return ch;
}
#endif /* USE_COM_LOG */
#endif /* USE_BSP_COM_FEATURE */

/**
  * @brief  Configures joystick GPIO and EXTI modes.
  * @param  JOY Joystick to be initialized
  * @param  JoyMode Button mode.
  *          This parameter can be one of the following values:
  *            @arg  JOY_MODE_GPIO: Joystick pins will be used as simple IOs
  *            @arg  JOY_MODE_EXTI: Joystick pins will be connected to EXTI line
  *                                 with interrupt generation capability
  * @param  JoyPins joystick pins to be initialized
  * @retval BSP status
  */
int32_t BSP_JOY_Init(JOY_TypeDef JOY, JOYMode_TypeDef JoyMode, JOYPin_TypeDef JoyPins)
{
  int32_t ret = BSP_ERROR_NONE;
  uint32_t joykey, key_pressed;
  GPIO_InitTypeDef gpio_init_structure;

  static BSP_EXTI_LineCallback JoyCallback[JOY_KEY_NUMBER] = {JOY1_SEL_EXTI_Callback,
                                                              JOY1_DOWN_EXTI_Callback,
                                                              JOY1_LEFT_EXTI_Callback,
                                                              JOY1_RIGHT_EXTI_Callback,
                                                              JOY1_UP_EXTI_Callback
                                                             };
  static const uint32_t JOY_EXTI_LINE[JOY_KEY_NUMBER]   = {JOY1_SEL_EXTI_LINE,
                                                           JOY1_DOWN_EXTI_LINE,
                                                           JOY1_LEFT_EXTI_LINE,
                                                           JOY1_RIGHT_EXTI_LINE,
                                                           JOY1_UP_EXTI_LINE
                                                          };
  static uint32_t  BSP_JOY_PRIO [JOY_KEY_NUMBER] ={BSP_JOY1_SEL_IT_PRIORITY,
                                                   BSP_JOY1_DOWN_IT_PRIORITY,
                                                   BSP_JOY1_LEFT_IT_PRIORITY,
                                                   BSP_JOY1_RIGHT_IT_PRIORITY,
                                                   BSP_JOY1_UP_IT_PRIORITY
                                                  };

  /* Store Joystick pins initialized */
  JoyPinsMask |= (uint32_t)JoyPins;

  /* Initialized the Joystick. */
  for(joykey = 0U; joykey < JOY_KEY_NUMBER ; joykey++)
  {
    key_pressed = 1UL << joykey;
    if((key_pressed & (uint32_t)JoyPins) == key_pressed)
    {
      if(JOY == JOY1)
      {
      /* Enable the JOY clock */
        if(key_pressed == (uint32_t)JOY_SEL)
        {
          JOY1_SEL_GPIO_CLK_ENABLE();
        }
        else if(key_pressed == (uint32_t)JOY_DOWN)
        {
          JOY1_DOWN_GPIO_CLK_ENABLE();
        }
        else if(key_pressed == (uint32_t) JOY_LEFT)
        {
          JOY1_LEFT_GPIO_CLK_ENABLE();
        }
        else if(key_pressed == (uint32_t) JOY_RIGHT)
        {
          JOY1_RIGHT_GPIO_CLK_ENABLE();
        }
        else
        {
          if(key_pressed == (uint32_t) JOY_UP)
          {
            JOY1_UP_GPIO_CLK_ENABLE();
          }
        }

        gpio_init_structure.Pin = JOY1_PIN[joykey];
        gpio_init_structure.Pull = GPIO_PULLUP;
        gpio_init_structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

        if (JoyMode == JOY_MODE_GPIO)
        {
          /* Configure Joy pin as input */
          gpio_init_structure.Mode = GPIO_MODE_INPUT;
          HAL_GPIO_Init(JOY1_PORT[joykey], &gpio_init_structure);
        }
        else /*(JoyMode == JOY_MODE_EXTI)*/
        {
          /* Configure Joy pin as input with External interrupt */
          gpio_init_structure.Mode = GPIO_MODE_IT_RISING_FALLING;
          HAL_GPIO_Init(JOY1_PORT[joykey], &gpio_init_structure);

         (void)HAL_EXTI_GetHandle(&hjoy_exti[joykey], JOY_EXTI_LINE[joykey]);
         (void)HAL_EXTI_RegisterCallback(&hjoy_exti[joykey],  HAL_EXTI_COMMON_CB_ID, JoyCallback[joykey]);

          /* Enable and set Joy EXTI Interrupt to the lowest priority */
          HAL_NVIC_SetPriority((IRQn_Type)(JOY1_IRQn[joykey]), BSP_JOY_PRIO[joykey], 0x00);
          HAL_NVIC_EnableIRQ((IRQn_Type)(JOY1_IRQn[joykey]));
        }
      }
    }
  }

  return ret;
}
/**
  * @brief  DeInit joystick GPIOs.
  * @param  JOY instance
  * @note   JOY DeInit does not disable the MFX, just set the MFX pins in Off mode
  * @param  JoyPins joystick pins to be de-initialized
  * @retval BSP status
  */
int32_t BSP_JOY_DeInit(JOY_TypeDef JOY, JOYPin_TypeDef JoyPins)
{
  uint32_t joykey, key_pressed;

  /* Store Joystick pins initialized */
  JoyPinsMask &= (uint32_t)JoyPins;

  /* Initialized the Joystick. */
  for(joykey = 0U; joykey < JOY_KEY_NUMBER ; joykey++)
  {
    key_pressed = 1UL << joykey;
    if((key_pressed & (uint32_t)JoyPins) == key_pressed)
    {
      if(JOY == JOY1)
      {
        /* Disable the JOY clock */
        switch(key_pressed)
        {
          case JOY_SEL:
          JOY1_SEL_GPIO_CLK_DISABLE();
          break;

          case JOY_DOWN:
          JOY1_DOWN_GPIO_CLK_DISABLE();
          break;

          case JOY_LEFT:
          JOY1_LEFT_GPIO_CLK_DISABLE();
          break;

          case JOY_RIGHT:
          JOY1_RIGHT_GPIO_CLK_DISABLE();
          break;

          case JOY_UP:
          JOY1_UP_GPIO_CLK_DISABLE();
          break;
          default:
          break;
        }
        HAL_GPIO_DeInit(JOY1_PORT[joykey], JOY1_PIN[joykey]);
      }
    }
  }
  return BSP_ERROR_NONE;
}
/**
* @brief  Returns the current joystick status.
* @retval Code of the joystick key pressed
*          This code can be one of the following values:
*            @arg  JOY_NONE
*            @arg  JOY_SEL
*            @arg  JOY_DOWN
*            @arg  JOY_LEFT
*            @arg  JOY_RIGHT
*            @arg  JOY_UP
*/
int32_t BSP_JOY_GetState(JOY_TypeDef JOY,uint32_t JoyPin)
{

